# რას აკეთებს justify-content და მისი ღირებულებები
# Justify-content თვისება CSS-ში გამოიყენება ელემენტების გასწორებისთვის ძირითადი ღერძის გასწვრივ flex კონტეინერში. ძირითადი ღერძი განისაზღვრება flex-direction თვისებით.

# დასაბუთებული შინაარსის ღირებულებები და რას აკეთებენ ისინი:
# flex-start:
# ასწორებს ნივთებს კონტეინერის დასაწყისში.
# flex-end:
# ასწორებს ნივთებს კონტეინერის ბოლოს.
# center:
# ათავსებს ელემენტებს მთავარი ღერძის გასწვრივ.
# space - between :
# ანაწილებს ნივთებს თანაბრად, პირველი ელემენტი დასაწყისში და ბოლო პუნქტი.
# space-around:
# ანაწილებს ნივთებს მათ გარშემო თანაბარი სივრცით. ნივთებს შორის სივრცე ორჯერ მეტია ბოლოებში.

# space-evenly:
# ანაწილებს ნივთებს თანაბარი სივრცით მათ შორის და გარშემო.

# start :
# ასწორებს ნივთებს კონტეინერის დასაწყისში

# end (მემკვიდრეობა):
# ასწორებს ნივთებს კონტეინერის ბოლოს 

# left/ right:
# ასწორებს ელემენტებს მარცხნივ ან მარჯვნივ