

//3)
// JavaScript არის პროგრამირების ენა, რომელიც გამოიყენება ვებსაიტებზე მოქმედებების შესასრულებლად.
// ის მუშაობს ბრაუზერში და აძლევს დინამიურობას ვებს.
// მაგალითად, შეგიძლიათ ღილაკზე დაჭერით ტექსტის შეცვლა.
// JavaScript შეიქმნა 1995 წელს და მალევე გახდა პოპულარული ენა ვებპროგრამირებისთვის.


//4)

// კონსოლი არის ინსტრუმენტი ბრაუზერში, რომლის საშუალებითაც დეველოპერები ამოწმებენ კოდს.
// console.log გამოიყენება ტექსტის გამოსატანად, შეცდომების მოსაძებნად და ლოგიკის შესამოწმებლად.
// ის გვაჩვენებს რა ხდება კოდში და დაგვეხმარება შეცდომების პოვნაში.

//5)

// მოვლენა არის ისეთი ქმედება, როგორიცაა ღილაკზე დაჭერა ან მაუსის გადატარება.

